# Data Aggregation and Group Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.716878  0.043166
1    a  two -0.606153 -1.950199
2    b  one  0.465717 -0.718705
3    b  two -0.265061 -0.732141
4    a  one  0.366169  0.745042

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a    0.492298
b    0.100328
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     1.041523
      two    -0.606153
b     one     0.465717
      two    -0.265061
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a     1.041523 -0.606153
b     0.465717 -0.265061

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -0.606153
            2006    0.465717
Ohio        2005    0.725908
            2006    0.366169
Name: data1, dtype: float64

In [8]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.492298 -0.387330
b     0.100328 -0.725423

In [9]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   1.041523  0.394104
     two  -0.606153 -1.950199
b    one   0.465717 -0.718705
     two  -0.265061 -0.732141

In [10]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [11]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.716878  0.043166
1    a  two -0.606153 -1.950199
4    a  one  0.366169  0.745042
b
  key1 key2     data1     data2
2    b  one  0.465717 -0.718705
3    b  two -0.265061 -0.732141

In [12]:
for (key1, key2), group in df.groupby(['key1', 'key2']):
    print(key1, key2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one  1.716878  0.043166
4    a  one  0.366169  0.745042
a two
  key1 key2     data1     data2
1    a  two -0.606153 -1.950199
b one
  key1 key2     data1     data2
2    b  one  0.465717 -0.718705
b two
  key1 key2     data1     data2
3    b  two -0.265061 -0.732141

In [13]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one     0.394104
      two    -1.950199
b     one    -0.718705
      two    -0.732141
Name: data2, dtype: float64

In [14]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [15]:
s_grouped.mean()

key1  key2
a     one     0.394104
      two    -1.950199
b     one    -0.718705
      two    -0.732141
Name: data2, dtype: float64

In [16]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe    -0.560517 -0.437102  0.106993 -0.489760 -0.686125
Steve  -0.371593  1.826284  0.758090 -1.205208 -0.281224
Wes     0.636337  0.683827  1.096512  0.764761  0.507583
Jim     1.214881  0.338942  0.714539  0.740599 -0.213441
Travis  0.688930  0.248455  1.523434  1.083466 -2.298729

In [17]:
people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe    -0.560517 -0.437102  0.106993 -0.489760 -0.686125
Steve  -0.371593  1.826284  0.758090 -1.205208 -0.281224
Wes     0.636337       NaN       NaN  0.764761  0.507583
Jim     1.214881  0.338942  0.714539  0.740599 -0.213441
Travis  0.688930  0.248455  1.523434  1.083466 -2.298729

In [18]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.mean()

            blue       red
Joe    -0.191384 -0.561248
Steve  -0.223559  0.391156
Wes     0.764761  0.571960
Jim     0.727569  0.446794
Travis  1.303450 -0.453781

In [19]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [20]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [21]:
df

  key1 key2     data1     data2
0    a  one  1.716878  0.043166
1    a  two -0.606153 -1.950199
2    b  one  0.465717 -0.718705
3    b  two -0.265061 -0.732141
4    a  one  0.366169  0.745042

In [22]:
def top(df, n=5, column='total_bill'):
    return df.sort_values(by=column)[-n:]